test/vcr_cassettes/reservations_machine_and_plan_using_coupon_retrieve_invoice_from_stripe.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices/in_18rNSq2sOmf47Nz91hxlGSa7
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.30.2
      Authorization:
      - Bearer sk_test_testfaketestfaketestfake
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.30.2","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.4.0-36-generic (buildd@lcy01-01) (gcc version 5.4.0 20160609 (Ubuntu
        5.4.0-6ubuntu1~16.04.2) ) #55-Ubuntu SMP Thu Aug 11 18:01:55 UTC 2016","hostname":"integration"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 08 Sep 2016 12:25:04 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3362'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_99l6aCLd0IC3Qn
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "in_18rNSq2sOmf47Nz91hxlGSa7",
          "object": "invoice",
          "amount_due": 3825,
          "application_fee": null,
          "attempt_count": 1,
          "attempted": true,
          "charge": "ch_18rNSq2sOmf47Nz9Z8EuuyI8",
          "closed": true,
          "currency": "usd",
          "customer": "cus_8Di1wjdVktv5kt",
          "date": 1473321652,
          "description": null,
          "discount": null,
          "ending_balance": 0,
          "forgiven": false,
          "lines": {
            "object": "list",
            "data": [
              {
                "id": "ii_18rNSp2sOmf47Nz9S0rJVP2a",
                "object": "line_item",
                "amount": -450,
                "currency": "usd",
                "description": "coupon SUNNYFABLAB",
                "discountable": false,
                "livemode": false,
                "metadata": {},
                "period": {
                  "start": 1473321651,
                  "end": 1473321651
                },
                "plan": null,
                "proration": false,
                "quantity": null,
                "subscription": null,
                "type": "invoiceitem"
              },
              {
                "id": "ii_18rNSm2sOmf47Nz9R11Svoer",
                "object": "line_item",
                "amount": -225,
                "currency": "usd",
                "description": "coupon SUNNYFABLAB",
                "discountable": false,
                "livemode": false,
                "metadata": {},
                "period": {
                  "start": 1473321648,
                  "end": 1473321648
                },
                "plan": null,
                "proration": false,
                "quantity": null,
                "subscription": null,
                "type": "invoiceitem"
              },
              {
                "id": "ii_18rNSm2sOmf47Nz9avgL9KyW",
                "object": "line_item",
                "amount": 1500,
                "currency": "usd",
                "description": "FORM1+ imprimante 3D September 04, 2016 14:00 - 03:00 PM",
                "discountable": true,
                "livemode": false,
                "metadata": {},
                "period": {
                  "start": 1473321648,
                  "end": 1473321648
                },
                "plan": null,
                "proration": false,
                "quantity": null,
                "subscription": null,
                "type": "invoiceitem"
              },
              {
                "id": "sub_99gqb47NmX9r79",
                "object": "line_item",
                "amount": 3000,
                "currency": "usd",
                "description": null,
                "discountable": true,
                "livemode": false,
                "metadata": {},
                "period": {
                  "start": 1473321652,
                  "end": 1475913652
                },
                "plan": {
                  "id": "mensuel-standard-month-20160404171519",
                  "object": "plan",
                  "amount": 3000,
                  "created": 1459782921,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Mensuel - standard, association - month",
                  "statement_descriptor": null,
                  "trial_period_days": null
                },
                "proration": false,
                "quantity": 1,
                "subscription": null,
                "type": "subscription"
              }
            ],
            "has_more": false,
            "total_count": 4,
            "url": "/v1/invoices/in_18rNSq2sOmf47Nz91hxlGSa7/lines"
          },
          "livemode": false,
          "metadata": {},
          "next_payment_attempt": null,
          "paid": true,
          "period_end": 1473321652,
          "period_start": 1473321652,
          "receipt_number": null,
          "starting_balance": 0,
          "statement_descriptor": null,
          "subscription": "sub_99gqb47NmX9r79",
          "subtotal": 3825,
          "tax": null,
          "tax_percent": null,
          "total": 3825,
          "webhooks_delivered_at": 1473321652
        }
    http_version:
  recorded_at: Thu, 08 Sep 2016 12:25:04 GMT
recorded_with: VCR 3.0.1
